Autodesk.Revit.DB.ServerPath.#ctor(System.String,System.String)
Constructs a ServerPath
centralServerLocation:
The name of the central Revit server
path:
The path of the model. This path must be relative.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ServerPath
This class represents a path to a Revit Server location, rather than a
location on disk or a network drive.
Remarks:
ServerPaths must refer to Revit models.
ServerPaths are relative to the central server location, and
are of the form "RSN://{HostNodeName}/{model_path}".
The {model_path} portion is a relative path to a Revit model.
For example, the following are valid server paths:
RSN://EXS/hospital.rvt
RSN://EXS.autodesk.com/Old Files/hotel2.rvt
RSN://EXS.autodesk.com/Old Files/Last Week/Tuesday\hotel2.rvt
The following would not be valid server paths:
//EXS/Old Files/.rvtEXS/hospital
Since:
2012